In [2]:
print('a')

a

In [5]:
import pandas as pd

In [7]:
CCTV_Seoul = pd.read_csv('CCTV_in_Seoul.csv', encoding='utf-8')
# 상위 5개만 읽어오기
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [8]:
CCTV_Seoul.head(3)

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204

In [11]:
type(list(CCTV_Seoul.columns))

list

In [16]:
list_a = ['a', 'b', 'c', 'd']

In [19]:
CCTV_Seoul.rename(columns={'기관명' : '구별'})
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [20]:
pop_Seoul = pd.read_excel('01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

### pandas 기초

In [22]:
import numpy as np

In [23]:
s = pd.Series([1,3,5,np.I, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [25]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [41]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,
                 columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  0.906479 -0.555578  0.826955 -1.068272
2013-01-02  1.191516  0.685016 -0.300126 -1.352038
2013-01-03 -0.732311 -0.866809  1.242097  1.492884
2013-01-04 -1.049667  1.142717 -0.934510 -0.315330
2013-01-05 -0.549513 -0.197964  0.031181 -1.784767
2013-01-06 -0.457548 -1.065794 -1.149022 -0.063892

In [27]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
df.values

array([[-0.49477448,  1.30429243,  0.44472119,  0.33609289],
       [ 0.51167869,  0.82883968,  1.37133124,  2.79304845],
       [-2.23451687, -0.5106621 , -0.97249421,  0.94793704],
       [-0.02030587,  0.17748354, -0.41973361,  0.95877231],
       [-0.63348886, -1.11891031, -1.47710307,  0.8138856 ],
       [-0.30757774, -0.31233483,  0.67610373, -0.88302833]])

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.529831  0.061451 -0.062862  0.827785
std    0.928621  0.895241  1.078470  1.188503
min   -2.234517 -1.118910 -1.477103 -0.883028
25%   -0.598810 -0.461080 -0.834304  0.455541
50%   -0.401176 -0.067426  0.012494  0.880911
75%   -0.092124  0.666001  0.618258  0.956063
max    0.511679  1.304292  1.371331  2.793048

In [38]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05 -0.633489 -1.118910 -1.477103  0.813886
2013-01-03 -2.234517 -0.510662 -0.972494  0.947937
2013-01-06 -0.307578 -0.312335  0.676104 -0.883028
2013-01-04 -0.020306  0.177484 -0.419734  0.958772
2013-01-02  0.511679  0.828840  1.371331  2.793048
2013-01-01 -0.494774  1.304292  0.444721  0.336093

In [43]:
df['A']

2013-01-01    0.906479
2013-01-02    1.191516
2013-01-03   -0.732311
2013-01-04   -1.049667
2013-01-05   -0.549513
2013-01-06   -0.457548
Freq: D, Name: A, dtype: float64

In [44]:
df[0:3]

                   A         B         C         D
2013-01-01  0.906479 -0.555578  0.826955 -1.068272
2013-01-02  1.191516  0.685016 -0.300126 -1.352038
2013-01-03 -0.732311 -0.866809  1.242097  1.492884

In [45]:
df.loc['2013-01-01']

A    0.906479
B   -0.555578
C    0.826955
D   -1.068272
Name: 2013-01-01 00:00:00, dtype: float64

In [46]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01  0.906479 -0.555578
2013-01-02  1.191516  0.685016
2013-01-03 -0.732311 -0.866809
2013-01-04 -1.049667  1.142717
2013-01-05 -0.549513 -0.197964
2013-01-06 -0.457548 -1.065794

In [2]:
import pandas as pd
import numpy as np

In [4]:
dates = pd.date_range('20220525', periods=6)

In [20]:
df = pd.DataFrame(np.random.randn(6,4), columns=['A', 'B', 'C', 'D'],
                  index=dates)

In [38]:
df['20220525':'20220527']

                   A         B         C         D
2022-05-25 -0.002943  0.033169  1.863807  0.191807
2022-05-26  0.917833 -0.779862 -0.269402 -1.547281
2022-05-27  0.226794  1.161515 -0.321983 -0.646976

In [33]:
df.A

2022-05-25   -0.002943
2022-05-26    0.917833
2022-05-27    0.226794
2022-05-28    0.897634
2022-05-29   -1.449480
2022-05-30   -0.028956
Freq: D, Name: A, dtype: float64

In [43]:
df.loc[:, 'A':'B']

                   A         B
2022-05-25 -0.002943  0.033169
2022-05-26  0.917833 -0.779862
2022-05-27  0.226794  1.161515
2022-05-28  0.897634  0.292491
2022-05-29 -1.449480 -0.590596
2022-05-30 -0.028956 -0.431902

In [44]:
df.loc['20220525']

A   -0.002943
B    0.033169
C    1.863807
D    0.191807
Name: 2022-05-25 00:00:00, dtype: float64

In [50]:
df.loc['20220525', ['A', 'B']]

A   -0.002943
B    0.033169
Name: 2022-05-25 00:00:00, dtype: float64